<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of FileMaker Pro and creates a package.
	Be sure to read the description of the parent recipe com.github.apizz.download.FileMakerProClaris
	for information on downloading the correct major release version using the PRODUCT_ID
	input variable.</string>
	<key>Identifier</key>
	<string>com.github.cyclonecomputers.pkg.FileMakerProClaris</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>FileMakerProClaris</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.apizz.download.FileMakerProClaris</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
			<key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
		</dict>
	</array>
</dict>
</plist>
