<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Creates a pkg for the supplied customer specific PCClient.app.

To obtain the PCClient application you need to look on the Papercut server in the
directory C:\Program Files\PaperCut MF\client\PCClient.app.

It is recommended that you zip this file before copying it to a Mac for packaging.</string>
	<key>Identifier</key>
	<string>com.github.cyclonecomputers.pkg.PCClient</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>PCClient</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.cyclonecomputers.download.PCClient</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%destination_path%</string>
				<key>plist_keys</key>
				<dict>
					<key>CFBundleShortVersionString</key>
					<string>version</string>
					<key>CFBundleIdentifier</key>
					<string>bundle_id</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PlistReader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%destination_path%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Applications/PCClient.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>force_pkg_build</key>
				<true/>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
							<key>mode</key>
							<string>0775</string>
						</dict>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>Applications/PCClient.app</string>
							<key>user</key>
							<string>root</string>
							<key>mode</key>
							<string>0775</string>
						</dict>
					</array>
					<key>id</key>
					<string>%bundle_id%</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>pkgdir</key>
					<string>%RECIPE_CACHE_DIR%</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/payload</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
	</array>
</dict>
</plist>
