<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Lego Education SPIKE v3 and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.cyclonecomputers.munki.LegoEducationSPIKE3</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>LegoEducationSPIKE3</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>If you have LEGO Education SPIKE Prime / LEGO Education SPIKE Essential then you need to install the SPIKE App. The SPIKE App Includes lessons, getting started tutorials, building instructions and help section.</string>
			<key>developer</key>
			<string>The LEGO Group</string>
			<key>display_name</key>
			<string>Lego Education SPIKE</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.cyclonecomputers.download.LegoEducationSPIKE3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
