<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Creates a pkg file for the current ScreenConnect installer.</string>
	<key>Identifier</key>
	<string>com.github.cyclonecomputers.pkg.ScreenConnect</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ScreenConnect</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.cyclonecomputers.download.ScreenConnect</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PkgCopier</string>
			<key>Arguments</key>
			<dict>
				<key>source_pkg</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%client_id%-%version%.pkg</string>
				<key>overwrite</key>
				<true/>
			</dict>
		</dict>
	</array>
</dict>
</plist>
