<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of LightBurn.</string>
	<key>Identifier</key>
	<string>com.github.cyclonecomputers.download.LightBurn</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>LightBurn</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://release.lightburnsoftware.com/LightBurn/Release/latest/</string>
				<key>re_pattern</key>
				<string>/LightBurn/Release/LightBurn-v([0-9\.]+)/LightBurn.V[0-9\.]+.dmg</string>
				<key>result_output_var_name</key>
				<string>version</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://release.lightburnsoftware.com/LightBurn/Release/latest/</string>
				<key>re_pattern</key>
				<string>/LightBurn/Release/LightBurn-v[0-9\.]+/LightBurn.V[0-9\.]+.dmg</string>
				<key>result_output_var_name</key>
				<string>match</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://release.lightburnsoftware.com%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/LightBurn.app</string>
				<key>requirement</key>
				<string>identifier "com.LightBurnSoftware.LightBurn" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UWZQ3LL82C</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
